#!python
import mysql.connector

# MySQL Connection 연결
mydb = mysql.connector.connect(
  host="localhost",
  user="mbu4135",
  passwd="1288zpmqal",
  charset="utf8",
  database="menshut"
)

mycursor = mydb.cursor()

sql = "insert into products(id, pid, pName, price, description, available, category, item, pCode, picture, date, info1, info2, info3, info4) values (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"
val = [
    (94, 94, '선인 딸기레진 1kg', '12900', '선인 딸기레진 1kg', '1000', 'b5', 'b594', 'b594', 'b594.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (95, 95, '선인 녹차레진 1kg', '18500', '선인 녹차레진 1kg', '1000', 'b5', 'b595', 'b595', 'b595.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (96, 96, '선인 옥수수레진 1kg', '12700', '선인 옥수수레진 1kg', '1000', 'b5', 'b596', 'b596', 'b596.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (97, 97, '선인 메론레진 1kg', '12900', '선인 메론레진 1kg', '1000', 'b5', 'b597', 'b597', 'b597.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (98, 98, '선인 바나나레진 1kg', '12700', '선인 바나나레진 1kg', '1000', 'b5', 'b598', 'b598', 'b598.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (99, 99, '선인 블루베리레진 1kg', '12900', '선인 블루베리레진 1kg', '1000', 'b5', 'b599', 'b599', 'b599.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (100, 100, '선인 포도레진 1kg', '12900', '선인 포도레진 1kg', '1000', 'b5', 'b5100', 'b5100', 'b5100.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (133, 133, '선인 건조 파슬리 250g', '4900', '선인 건조 파슬리 250g', '1000', 'd1', 'd1133', 'd1133', 'd1133.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 250g, 개입량 : 1개입', ''),
]
mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")
