#!python
import mysql.connector

# MySQL Connection 연결
mydb = mysql.connector.connect(
  host="localhost",
  user="mbu4135",
  passwd="1288zpmqal",
  charset="utf8",
  database="menshut"
)

mycursor = mydb.cursor()

sql = "insert into products(id, pid, pName, price, description, available, category, item, pCode, picture, date, info1, info2, info3, info4) values (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"
val = [
    (112, 112, '큐원 갈색설탕 15kg', '24400', '큐원 갈색설탕 15kg', '1000', 'b2', 'b2112', 'b2112', 'b2112.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 15kg, 개입량 : 1개입', ''),
    (113, 113, '큐원 흑설탕 15kg', '25500', '큐원 흑설탕 15kg', '1000', 'b2', 'b2113', 'b2113', 'b2113.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 15kg, 개입량 : 1개입', ''),
    (114, 114, '큐원 하얀설탕 15kg', '12800', '큐원 하얀설탕 15kg', '1000', 'b2', 'b2114', 'b2114', 'b2114.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 15kg, 개입량 : 1개입', ''),
    (115, 115, '큐원 분당 20kg', '32800', '큐원 분당 20kg', '1000', 'b2', 'b2115', 'b2115', 'b2115.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 20kg, 개입량 : 1개입', ''),
    (116, 116, '자라메 설탕 1kg', '8000', '자라메 설탕 1kg', '1000', 'b2', 'b2116', 'b2116', 'b2116.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (117, 117, '큐원 하얀설탕 3kg', '4000', '큐원 분당 20kg', '1000', 'b2', 'b2117', 'b2117', 'b2117.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 3kg, 개입량 : 1개입', ''),
    (118, 118, '큐원 갈색설탕 1kg', '1950', '큐원 갈색설탕 1kg', '1000', 'b2', 'b2118', 'b2118', 'b2118.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (119, 119, '큐원 흑설탕 1kg', '1950', '큐원 흑설탕 1kg', '1000', 'b2', 'b2119', 'b2119', 'b2119.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (120, 120, '꼬미다 슈가파우더 3kg', '4500', '꼬미다 슈가파우더 3kg', '1000', 'b2', 'b2120', 'b2120', 'b2120.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 3kg, 개입량 : 1개입', ''),
    (250, 250, '꼬미다분당 1kg / 설탕100% 슈가파우다 꼬미다슈가파우더 전분없는슈가파우더', '2100', '꼬미다분당 1kg / 설탕100% 슈가파우다 꼬미다슈가파우더 전분없는슈가파우더', '1000', 'b2', 'b2250', 'b2250', 'b2250.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (317, 317, '큐원 하이슈가코트 10kg /하이,슈거,코트,포도당', '23000', '큐원 하이슈가코트 10kg /하이,슈거,코트,포도당', '1000', 'b2', 'b2317', 'b2317', 'b2317.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 10kg, 개입량 : 1개입', ''),
]
mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")
