#!python
import mysql.connector

# MySQL Connection 연결
mydb = mysql.connector.connect(
  host="localhost",
  user="mbu4135",
  passwd="1288zpmqal",
  charset="utf8",
  database="menshut"
)

mycursor = mydb.cursor()

sql = "insert into products(id, pid, pName, price, description, available, category, item, pCode, picture, date, info1, info2, info3, info4) values (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"
val = [
    (89, 89, '오뚜기 콤비 쇼팅 4.5kg - 쇼트닝', '8200', '오뚜기 콤비 쇼팅 4.5kg - 쇼트닝', '1000', 'c1', 'c189', 'c189', 'c189.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 4/5kg, 개입량 : 1개입', ''),
    (154, 154, 'ANCHOR 앵커버터 454g (무염/유크림100%)', '5500', 'ANCHOR 앵커버터 454g (무염/유크림100%)', '1000', 'c1', 'c1154', 'c1154', 'c1154.jpg', '2020-04-15 18:33:40', '필요', '냉동보관', '내용량 : 454g, 개입량 : 1개입', ''),
    (155, 155, '엘르앤비르고메버터 500g 무염버터 발효버터 최상급버터', '9900', '엘르앤비르고메버터 500g 무염버터 발효버터 최상급버터', '1000', 'c1', 'c1155', 'c1155', 'c1155.jpg', '2020-04-15 18:33:40', '필요', '냉동보관', '내용량 : 500g, 개입량 : 1개입', ''),
    (156, 156, '[무료배송] 앵커버터1박스 9.08kg (454gx20개)', '106000', '[무료배송] 앵커버터1박스 9.08kg (454gx20개)', '1000', 'c1', 'c1156', 'c1156', 'c1156.jpg', '2020-04-15 18:33:40', '필요', '냉동보관', '내용량 : 9.08kg, 개입량 : 20개입', ''),
    (157, 157, '엘르앤비르 엑스트라드라이버터 1kg (프랑스산 버터시트 판버터)', '18490', '엘르앤비르 엑스트라드라이버터 1kg (프랑스산 버터시트 판버터)', '1000', 'c1', 'c1157', 'c1157', 'c1157.jpg', '2020-04-15 18:33:40', '필요', '냉동보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (158, 158, '엘르앤비르 엑스트라 드라이버터 1박스 (1kg *10개입) (프랑스버터 고메버터시트 판버터)', '184900', '엘르앤비르 엑스트라 드라이버터 1박스 (1k *10개입) (프랑스버터 고메버터시트 판버터)', '1000', 'c1', 'c1158', 'c1158', 'c1158.jpg', '2020-04-15 18:33:40', '필요', '냉동보관', '내용량 : 10kg, 개입량 : 10개입', ''),
    (159, 159, '오뚜기 브레드5000 마가린 4.5kg', '7790', '오뚜기 브레드5000 마가린 4.5kg', '1000', 'c1', 'c1159', 'c1159', 'c1159.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 4.5kg, 개입량 : 1개입', ''),
    (160, 160, '그랜드500 FREE _4.5kg (중급다목적)', '15800', '그랜드500 FREE _4.5kg (중급다목적)', '1000', 'c1', 'c1160', 'c1160', 'c1160.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 4.5kg, 개입량 : 1개입', ''),
    (190, 190, '프리페어드에더블팻 (PEF 225) 12.5kg (79%) / 콤파운드버터', '104000', '프리페어드에더블팻 (PEF 225) 12.5kg (79%) / 콤파운드버터', '1000', 'c1', 'c1190', 'c1190', 'c1190.jpg', '2020-04-15 18:33:40', '필요', '냉동보관', '내용량 : 12.5kg, 개입량 : 1개입', ''),
    (280, 280, '롯데우유버터화이트 4.5kg (무염/높은유지방함량/흰색버터)', '36300', '롯데우유버터화이트 4.5kg (무염/높은유지방함량/흰색버터)', '1000', 'c1', 'c1280', 'c1280', 'c1280.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 4.5kg, 개입량 : 1개입', ''),
    (282, 282, '월드컴파운드버터 9kg (가공버터/콤파운드버터/대용량,월드콤파운드)', '58900', '월드컴파운드버터 9kg (가공버터/콤파운드버터/대용량,월드콤파운드)', '1000', 'c1', 'c1282', 'c1282', 'c1282.jpg', '2020-04-15 18:33:40', '필요', '냉동보관', '내용량 : 9kg, 개입량 : 1개입', ''),
    (313, 313, '오뚜기 프라임 프리 마가린 4.5kg /콤파운드,컴파운드,free', '10840', '오뚜기 프라임 프리 마가린 4.5kg /콤파운드,컴파운드,free', '1000', 'c1', 'c1313', 'c1313', 'c1313.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 4.5kg, 개입량 : 1개입', ''),
]
mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")
