#!python
import mysql.connector

# MySQL Connection 연결
mydb = mysql.connector.connect(
  host="localhost",
  user="mbu4135",
  passwd="1288zpmqal",
  charset="utf8",
  database="menshut"
)

mycursor = mydb.cursor()

sql = "insert into products(id, pid, pName, price, description, available, category, item, pCode, picture, date, info1, info2, info3, info4) values (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"
val = [
    (135, 135, '냉동 크랜베리 500g', '3600', '냉동 크랜베리 500g', '1000', 'd2', 'd2136', 'd2136', 'd2136.jpg', '2020-04-15 18:33:40', '필요', '냉동보관', '내용량 : 500g, 개입량 : 1개입', ''),
    (136, 136, '반건조무화과 2kg (터키)', '21000', '반건조무화과 2kg (터키)', '1000', 'd2', 'd2136', 'd2136', 'd2136.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 2kg, 개입량 : 1개입', ''),
    (137, 137, '선인 건조크랜베리 1kg', '7600', '선인 건조크랜베리 1kg', '1000', 'd2', 'd2137', 'd2137', 'd2137.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (138, 138, '설정식품 사과다이스 3kg (고형량1.6kg/국내산)', '11000', '설정식품 사과다이스 3kg (고형량1.6kg/국내산)', '1000', 'd2', 'd2138', 'd2138', 'd2138.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 3kg, 개입량 : 1개입', ''),
    (139, 139, '설정식품 웰스피아 고구마다이스 3kg', '11000', '설정식품 웰스피아 고구마다이스 3kg', '1000', 'd2', 'd2139', 'd2139', 'd2139.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 3kg, 개입량 : 1개입', ''),
    (216, 216, '선인 당적 크랜베리 500g', '5000', '선인 당적 크랜베리 500g', '1000', 'd2', 'd2216', 'd2216', 'd2216.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 500g, 개입량 : 1개입', ''),
    (303, 303, '선인 건조크랜베리 1kg / 건크렌베리', '7600', '선인 건조크랜베리 1kg / 건크렌베리', '1000', 'd2', 'd2303', 'd2303', 'd2303.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (318, 318, '황도 남아공 480g', '3500', '황도 남아공 480g', '1000', 'd2', 'd2318', 'd2318', 'd2318.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 480g, 개입량 : 1개입', ''),
]
mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")
