#!python
import mysql.connector

# MySQL Connection 연결
mydb = mysql.connector.connect(
  host="localhost",
  user="mbu4135",
  passwd="1288zpmqal",
  charset="utf8",
  database="menshut"
)

mycursor = mydb.cursor()

sql = "insert into products(id, pid, pName, price, description, available, category, item, pCode, picture, date, info1, info2, info3, info4) values (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"
val = [
    (172, 172, '끼리크림치즈 1kg (프랑스크림치즈)', '15200', '끼리크림치즈 1kg (프랑스크림치즈)', '1000', 'c3', 'c3172', 'c3172', 'c3172.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (173, 173, '매일 베이커리슬라이스치즈 50 II 100매 1.8kg / 체다치즈', '12500', '매일 베이커리슬라이스치즈 50 II 100매 1.8kg / 체다치즈', '1000', 'c3', 'c3173', 'c3173', 'c3173.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 1.8kg, 개입량 : 1개입', ''),
    (174, 174, '매일 고소한 롤치즈 1kg /매일롤치즈', '10500', '매일 고소한 롤치즈 1kg /매일롤치즈', '1000', 'c3', 'c3174', 'c3174', 'c3174.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (175, 175, '선인 크림치즈무스 1kg / 스위트치즈스프레드', '8040', '선인 크림치즈무스 1kg / 스위트치즈스프레드', '1000', 'c3', 'c3175', 'c3175', 'c3175.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (176, 176, '베이커리 롤치즈 1kg /서울롤치즈', '11500', '베이커리 롤치즈 1kg /서울롤치즈', '1000', 'c3', 'c3176', 'c3176', 'c3176.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (227, 227, '매일 고소한 롤치즈 1kg /매일롤치즈', '10500', '매일 고소한 롤치즈 1kg /매일롤치즈', '1000', 'c3', 'c3227', 'c3227', 'c3227.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (264, 264, '엘레앤비르 오리지널 아메리칸 크림치즈 1.36kg /엘르앤비르', '15200', '엘레앤비르 오리지널 아메리칸 크림치즈 1.36kg /엘르앤비르', '1000', 'c3', 'c3264', 'c3264', 'c3264.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 1.36kg, 개입량 : 1개입', ''),
    (269, 269, '에멘탈크림치즈 1kg (참에멘탈치즈) / 스위스치즈', '15200', '에멘탈크림치즈 1kg (참에멘탈치즈) / 스위스치즈', '1000', 'c3', 'c3269', 'c3269', 'c3269.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (316, 316, '필라델피아크림치즈 1.36kg (미국산크림치즈)', '15200', '필라델피아크림치즈 1.36kg (미국산크림치즈)', '1000', 'c3', 'c3316', 'c3316', 'c3316.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 1.36kg, 개입량 : 1개입', ''),
]
mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")
