#!python
import mysql.connector

# MySQL Connection 연결
mydb = mysql.connector.connect(
  host="localhost",
  user="mbu4135",
  passwd="1288zpmqal",
  charset="utf8",
  database="menshut"
)

mycursor = mydb.cursor()

sql = "insert into products(id, pid, pName, price, description, available, category, item, pCode, picture, date, info1, info2, info3, info4) values (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"
val = [
    (91, 91, '메디락 골드 1kg', '3200', '메디락 골드 1kg', '1000', 'b4', 'b491', 'b491', 'b491.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (142, 142, '사프 드라이이스트 레드 500g (저당용)', '4400', '사프 드라이이스트 레드 500g (저당용)', '1000', 'b4', 'b4142', 'b4142', 'b4142.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 500g, 개입량 : 1개입', ''),
    (143, 143, '사프 드라이이스트 골드 500g (고당용)', '4400', '사프 드라이이스트 골드 500g (고당용)', '1000', 'b4', 'b4143', 'b4143', 'b4143.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 500g, 개입량 : 1개입', ''),
    (144, 144, '제니코 생이스트 500g (국산)', '2100', '제니코 생이스트 500g (국산)', '1000', 'b4', 'b4144', 'b4144', 'b4144.jpg', '2020-04-15 18:33:40', '필요', '냉장보관', '내용량 : 500g, 개입량 : 1개입', ''),
    (145, 145, '제니코 베이킹파우더 블루(포뮬러2) 300g', '1150', '제니코 베이킹파우더 블루(포뮬러2) 300g', '1000', 'b4', 'b4145', 'b4145', 'b4145.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 300g, 개입량 : 1개입', ''),
    (146, 146, '선인 사프 비비제이 500g (BBJ)', '8400', '선인 사프 비비제이 500g (BBJ)', '1000', 'b4', 'b4146', 'b4146', 'b4146.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 500g, 개입량 : 1개입', ''),
    (147, 147, '신광 베이킹소다 1kg', '1500', '신광 베이킹소다 1kg', '1000', 'b4', 'b4147', 'b4147', 'b4147.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
    (149, 149, '퓨라토스 S-500 제빵계량제 500g / 개량제,에스500', '3400', '퓨라토스 S-500 제빵계량제 500g / 개량제,에스500', '1000', 'b4', 'b4149', 'b4149', 'b4149.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 500g, 개입량 : 1개입', ''),
    (150, 150, '분말젤라틴 450g', '10500', '분말젤라틴 450g', '1000', 'b4', 'b4150', 'b4150', 'b4150.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 450g, 개입량 : 1개입', ''),
    (151, 151, '큐원 물엿 5kg', '6500', '큐원 물엿 5kg', '1000', 'b4', 'b4151', 'b4151', 'b4151.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 5kg, 개입량 : 1개입', ''),
    (192, 192, '제니코 베이킹 파우더 포뮬러 2 300g - BP', '1150', '제니코 베이킹 파우더 포뮬러 2 300g - BP', '1000', 'b4', 'b4192', 'b4192', 'b4192.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 300g, 개입량 : 1개입', ''),
    (272, 272, '퓨라토스 에스500 키모 5kg / 냉동생지용 제빵개량제', '36000', '퓨라토스 에스500 키모 5kg / 냉동생지용 제빵개량제', '1000', 'b4', 'b4272', 'b4272', 'b4272.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 5kg, 개입량 : 1개입', ''),
    (273, 273, '에프리코트혼당 (5kg) / 애프리코트,광택제,살구,Africot Fondant', '22000', '에프리코트혼당 (5kg) / 애프리코트,광택제,살구,Africot Fondant', '1000', 'b4', 'b4273', 'b4273', 'b4273.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 5kg, 개입량 : 1개입', ''),
    (310, 310, '선인 판젤라틴 1kg (약500장) / 리프젤라틴,젤라틴', '39500', '선인 판젤라틴 1kg (약500장) / 리프젤라틴,젤라틴', '1000', 'b4', 'b4310', 'b4310', 'b4310.jpg', '2020-04-15 18:33:40', '불필요', '실온보관', '내용량 : 1kg, 개입량 : 1개입', ''),
]
mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")
